Tekla Open API Reference for Tekla Structures 2025
WpfProfileCatalog.Dispose Method
 Cleans up any resources being used.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
WpfProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace